app/views/posts/search.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

                    <% if search.comments.size >= 1 %>