app/controllers/categories_controller.rb

	def index
		@categories = Category.all.order("created_at ASC")
		@recent_posts= Post.limit(4).order('created_at DESC')
---
SELECT "categories".* FROM "categories" ORDER BY created_at ASC
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 4]]

	def show
		@posts = Post.where(category_id: [@category.id]).paginate(page: params[:page], per_page: 40)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = 2 LIMIT ? OFFSET ?  [["LIMIT", 40], ["OFFSET", 0]]

	def create
		@category = Category.new(category_params)
		if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "precaution_bold", "precaution_red", "precaution_large", "blurb", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def update
		if @category.update(category_params)
---
UPDATE "categories" SET "precaution_uri" = ?, "precaution_uri_title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["precaution_uri", "https://www.yahoo.co.jp/"], ["precaution_uri_title", "Yahoo"], ["updated_at", "2019-02-26 11:12:29.128361"], ["id", 7]]

	def find_category
		@category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]