app/controllers/posts_controller.rb

	def index
		if params[:category].blank?
    	@posts = Post.all.order("created_at DESC").paginate(page: params[:page], per_page: 40)
    else
      @category_id = Category.find_by(name: params[:category]).id
      @posts = Post.where(:category_id => @category_id).paginate(page: params[:page], per_page: 40)
---
SELECT "categories".* FROM "categories" ORDER BY created_at ASC
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 40], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Pain Relief"], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 40], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 1]]

	def show
		 @post = Post.find_by(id: params[:id])
		#showでは@postしか使わなかったのでほかを削除
    #@likes = Like.where(prototype_id: params[:id])
    @comments_by_votes = @post.comments.order_by_voute_count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" LEFT OUTER JOIN "votes" ON "votes"."comment_id" = "comments"."id" WHERE "comments"."post_id" = ? GROUP BY "comments"."id" ORDER BY count(votes.id) desc  [["post_id", 1]]

	def new
		#@post = Post.new
		@post = current_user.posts.build
		@categories = Category.all.map{ |c| [c.name, c.id]}
---
SELECT "categories".* FROM "categories"

	def create
		@post = current_user.posts.build(post_params)
		@post.category_id = params[:category_id]

		if @post.save
			redirect_to @post
  	else
  		@categories = Category.all.map{ |c| [c.name, c.id]}
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "image", "user_id", "category_id", "med_purpose", "medical_type", "indication", "attn_large", "attn_bold", "attn_regular", "attn_red", "active_large", "active_regular", "active_red", "dose", "inactive_regular", "inactive_bold", "inactive_red", "instructions_regular", "instructions_bold", "instructions_red", "other_info_regular", "other_info_bold", "other_info_red", "link_note", "en_source", "jp_source", "en_pdf", "jp_pdf", "en_precautions") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "categories".* FROM "categories"

	def edit
		@categories = Category.all.map{ |c| [c.name, c.id]}
	  @extraimgs = Extraimg.where(post_id: [@post.id])
	  @infoimgs = Infoimg.where(post_id: [@post.id])
---
SELECT "categories".* FROM "categories"
SELECT "extraimgs".* FROM "extraimgs" WHERE "extraimgs"."post_id" = 1
SELECT "infoimgs".* FROM "infoimgs" WHERE "infoimgs"."post_id" = 1

	def update
		 @post.category_id = params[:category_id]

  	if @post.update(post_params)
  		redirect_to post_path
  	else
  		@categories = Category.all.map{ |c| [c.name, c.id]}
	    @extraimgs = Extraimg.where(post_id: [@post.id])
	    @infoimgs = Infoimg.where(post_id: [@post.id])
---
UPDATE "posts" SET "instructions_red" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["instructions_red", "Unicorn raw denim celiac, sustainable pickled readymade art party pabst "], ["updated_at", "2019-03-02 22:32:20.215521"], ["id", 1]]
SELECT "extraimgs".* FROM "extraimgs" WHERE "extraimgs"."post_id" = ? AND "extraimgs"."id" = 1  [["post_id", 1]]
SELECT "infoimgs".* FROM "infoimgs" WHERE "infoimgs"."post_id" = ? AND "infoimgs"."id" = 1  [["post_id", 8]]

  def find_post
  	@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]