app/views/categories/index.html.erb

               </div>
  						 <p class="text-muted"><%= category.posts.size %> items</p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 1]]