app/views/categories/show.html.erb


                <% if post.comments.size >= 1 %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]