app/views/layouts/_header.html.erb

SELECT "categories".* FROM "categories"
---
          <!-- <ul class="dropdown-item"> -->
            <% Category.all.each do |category| %>